<template lang="pug">
div
    .content
        h1 О нашей компании
        p(v-html="text") {{ text }} 
    Chess(:title="chessTitle" :desc="chessDesc" :chessList="chessList")
    Banner(:title="bannerTitle" :desc="bannerDesc" :img="bannerImg")
</template>

<script>
export default{
    name: 'AboutUs',
    data() {
        return {
            bannerTitle: 'Свяжитесь с нами',
            bannerDesc: 'Свяжитесь с нами и мы расскажем, как вам оформить заказ и ответим на все ваши вопросы',
            bannerImg: require('~/assets/images/banner.png'),
            chessTitle: 'Преимущества при работе с нами',
            chessDesc: 'Мы стремимся работать так, чтобы к нам возвращались снова и снова',
            chessList: [
            {
            title: 'Безупречное качество',
            desc: 'Мы тщательно отбираем свежие фрукты и овощи у надежных поставщиков, чтобы убедиться, что каждая посылка, доставленная к вам, соответствует нашим высоким стандартам качества.',
            img: require('~/assets/images/qual.jpg')
            },
            {
            title: 'Быстрая и удобная доставка',
            desc: 'Мы стараемся организовать  быструю и надежную доставку прямо к вашей двери. Независимо от вашего местоположения, вы можете быть уверены, что ваши продукты будут доставлены вовремя.',
            img: require('~/assets/images/del.jpg')
            },
            {
            title: 'Широкий ассортимент',
            desc: 'Мы предлагаем широкий выбор фруктов и овощей, чтобы удовлетворить любой вкус и предпочтение. От классических и сезонных продуктов до экзотических фруктов и овощей - у нас есть все, что вам нужно',
            img: require('~/assets/images/assort.jpg')
            },

      ],
            text: `Добро пожаловать во Fruit-Atlas, наш универсальный интернет-магазин самых свежих фруктов и овощей.

Наша миссия состоит в том, чтобы предоставить нашим клиентам спелую и вкусную продукцию, доставленную прямо к их порогу.

Мы поставляем фрукты и овощи привезенные с разных стран мира, гарантируя, что каждый продукт был собран на пике зрелости. 

В дополнение к нашей стандартной службе доставки мы также предлагаем услугу подписки, где клиенты могут еженедельно получать доставку тщательно отобранных фруктов и овощей. Это отличный вариант для тех, кто хочет питаться сезонно и пробовать новые продукты.

Мы стараемся становиться лучше с каждым днем, поэтому внимательно следим за тем, чтобы наши клиенты всегда оставались довольными.
Благодарим вас за выбор Fruit Atlas!

Мы будем рады доставить свежие, вкусные фрукты и овощи к вашей двери.`
        }
    },
    head(){
        return {
          title: 'Fruit Atlas - Доставка свежих овощей и фруктов в Москве',
          meta: [
            { charset: 'utf-8' },
            { name: 'viewport', content: 'width=device-width, initial-scale=1' },
            {
              hid: 'description',
              name: 'description',
              content: 'Мы компания по доставке овощей и фруктов оптом и в розницу'
            }
          ],
        }
      },
}
</script>

<style lang="scss" scoped>
.content{
    padding: 16px;
    min-height: 600px;
    @media(min-width: 992px){
            padding: 32px;
            width: 900px;
            margin: 0 auto;
    }
    h1{
        margin-bottom: 20px;
    }
    p{
        white-space: pre-line;
        @media(min-width: 992px){
            font-size: 18px;
        }
        span{
        font-family: "EuclidBold";
    }
    }
}

</style>