<template lang="pug">
.content
    h1 О нашей компании
    p(v-html="text") {{ text }}    
</template>

<script>
export default{
    name: 'AboutUs',
    head(){
        return {
          title: 'О Компании Fruit Atlas'
        }
    },
    data() {
        return {
            text: `Добро пожаловать во Fruit-Atlas, наш универсальный интернет-магазин самых свежих фруктов и овощей.

Наша миссия состоит в том, чтобы предоставить нашим клиентам спелую и вкусную продукцию, доставленную прямо к их порогу.

Мы поставляем фрукты и овощи привезенные с разных стран мира, гарантируя, что каждый продукт был собран на пике зрелости. 

В дополнение к нашей стандартной службе доставки мы также предлагаем услугу подписки, где клиенты могут еженедельно получать доставку тщательно отобранных фруктов и овощей. Это отличный вариант для тех, кто хочет питаться сезонно и пробовать новые продукты.

Мы стараемся становиться лучше с каждым днем, поэтому внимательно следим за тем, чтобы наши клиенты всегда оставались довольными.
Благодарим вас за выбор Fruit Atlas!

Мы будем рады доставить свежие, вкусные фрукты и овощи к вашей двери.`
        }
    }
}
</script>

<style lang="scss" scoped>
.content{
    padding: 16px;
    min-height: 600px;
    @media(min-width: 992px){
            padding: 32px;
            width: 900px;
            margin: 0 auto;
    }
    h1{
        margin-bottom: 20px;
    }
    p{
        white-space: pre-line;
        @media(min-width: 992px){
            font-size: 18px;
        }
        span{
        font-family: "EuclidBold";
    }
    }
}

</style>